<?php

return [
    'sales_rep' => [
        'not_fount' => 'Мы не нашли Торгового представителя',
        'not_fount_in_db' => 'Ваш торговый представитель не найден в базе данных при сохранении данных.'
    ],
    'status' => [
        'success' => 'Успешно',
        'error' => 'Ошибка',
    ],
    'main' => [
        'send_iin' => 'Продолжим: Введите ваш ИИН/БИН компании',
        'iin_max_12' => 'ИИН/БИН должен состоять ровно из 12 цифр и содержать только цифры',
        'iin_exists' => 'Данный ИИН/БИН уже зарегистрирован.',
        'share_contact' => 'Поделиться контактом',
        'your_phone' => 'Твой номер телефона ☎',
        'button_share_contact' => 'Нажми на кнопку "Поделиться контактом"',
        'phone_exists' => 'Данный номер уже зарегистрирован.',
        'successfully_registered' => 'Отлично, теперь Вы зарегистрированы! ',
        'menu' => 'Давайте посмотрим главное меню.',
        'exists' => 'Вы уже зарегистрированы и не можете пройти регистрацию повторно.',
        'start' => 'Здравствуйте! Добро пожаловать в наш сервис. Для регистрации в нашей системе, пожалуйста, следуйте следующим шагам',
        'scan' => 'Сканировать',
        'scan_camera' => 'Отлично! Давайте начнем. Спросите торгового представителя его QR-код  и сканируйте этот код нажав на кнопку ниже.',
        'main_menu' => 'Главное меню',
    ],
    'links' => [
        'instruct_doc24' => 'Инструкция по системе Договор 24',
        'register' => 'Регистрация на Договор24'
    ],
    'buttons' => [
        'register' => 'Зарегистрироваться',
        'terms' => 'Условия использования телеграм бота',
    ]
];
