<?php

return [
    'sales_rep' => [
        'not_fount' => 'Біз Сауда өкілін таба алмадық',
        'not_fount_in_db' => 'Сауда өкілі дерекқорда деректерді сақтағанда табылмады.'
    ],
    'status' => [
        'success' => 'Сәтті',
        'error' => 'Қате',
    ],
    'main' => [
        'send_iin' => 'Жалғастырамыз: Компанияның ЖСН/БСН енгізіңіз',
        'iin_max_12' => 'ЖСН/БСН дәл 12 саннан тұруы керек және тек сандарды қамтуы керек',
        'iin_exists' => 'Бұл ЖСН/БСН тіркелген.',
        'share_contact' => 'Байланыс мәліметтерін бөлісу',
        'your_phone' => 'Сіздің телефон нөміріңіз ☎',
        'button_share_contact' => 'Байланыс мәліметтерін бөлісу түймесін басыңыз',
        'phone_exists' => 'Бұл нөмір тіркелген.',
        'successfully_registered' => 'Тамаша, енді сіз тіркелдіңіз! ',
        'menu' => 'Негізгі мәзірді қарастырайық.',
        'exists' => 'Сіз қазірдің өзінде тіркелгенсіз және қайта тіркеле алмайсыз.',
        'start' => 'Сәлеметсіз бе! Қызметімізге қош келдіңіз. Біздің жүйеге тіркелу үшін келесі қадамдарды орындаңыз',
        'scan' => 'Сканерлеу',
        'scan_camera' => 'Тамаша! Бастайық. Сауда өкілінен оның QR кодын сұраңыз және төмендегі түймені басу арқылы осы кодты сканерлеңіз.',
        'main_menu' => 'Басты бет',
    ],
    'links' => [
        'instruct_doc24' => 'Шарт 24 жүйесі бойынша нұсқаулық',
        'register' => 'Шарт24 жүйесіне тіркелу'
    ],
    'buttons' => [
        'register' => 'Тіркелу',
        'terms' => 'Ботты қолдынау',
    ]
];
