<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

return new class extends Migration
{
    /**
     * Run the migrations.
     */
    public function up(): void
    {
        Schema::table('positions', function (Blueprint $table) {
            if (!Schema::hasColumn('positions', 'type')) {
                $table->string('type')->default('ПД');
            }
        });

        \App\Models\Position::create([
            'name_kk' => 'Бас инженер',
            'name_ru' => 'Главный инженер',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Өндірістік-техникалық бөлім бастығы',
            'name_ru' => 'Начальник производственно-технического отдела',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: тірек және қоршау конструкциялары бойынша: гидротехник',
            'name_ru' => 'Начальник участка: по несущим и ограждающим конструкциям: гидротехник',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: тірек және қоршау конструкциялары бойынша: құрылыс',
            'name_ru' => 'Начальник участка: по несущим и ограждающим конструкциям: строительство',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: инженерлік желілер мен құрылыстар бойынша: жылугазбен жабдықтау және желдету',
            'name_ru' => 'Начальник участка: по инженерным сетям и сооружениям: теплогазоснабжение и вентиляция',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: инженерлік желілер мен құрылыстар бойынша: сумен жабдықтау және канализация/сумен жабдықтау және су шығару',
            'name_ru' => 'Начальник участка: по инженерным сетям и сооружениям: водоснабжение и канализация/водоснабжение и водоотведение',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: инженерлік желілер мен құрылыстар бойынша: байланыс инженері',
            'name_ru' => 'Начальник участка: по инженерным сетям и сооружениям: инженер связи',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: инженерлік желілер мен құрылыстар бойынша: электр инженері',
            'name_ru' => 'Начальник участка: по инженерным сетям и сооружениям: инженер-электрик',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: инженерлік желілер мен құрылыстар бойынша: мұнай және газ инженері',
            'name_ru' => 'Начальник участка: по инженерным сетям и сооружениям: инженер нефти и газа',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: көлік құрылысы бойынша: автомобиль жолдары мен аэродромдар инженері',
            'name_ru' => 'Начальник участка: по транспортному строительству: инженер автомобильных дорог и аэродромов',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: көлік құрылысы бойынша: көпірлер мен тоннельдер инженері',
            'name_ru' => 'Начальник участка: по транспортному строительству: инженер мостов и тоннелей',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: көлік құрылысы бойынша: теміржол жолдары инженері',
            'name_ru' => 'Начальник участка: по транспортному строительству: инженер железнодорожных путей',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: технологиялық жабдықтар бойынша',
            'name_ru' => 'Начальник участка: по технологическому оборудованию',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: тірек және қоршау конструкциялары бойынша: гидротехник',
            'name_ru' => 'Производитель работ: по несущим и ограждающим конструкциям: гидротехник',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: тірек және қоршау конструкциялары бойынша: құрылыс',
            'name_ru' => 'Производитель работ: по несущим и ограждающим конструкциям: строительство',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: инженерлік желілер мен құрылыстар бойынша: жылугазбен жабдықтау және желдету',
            'name_ru' => 'Производитель работ: по инженерным сетям и сооружениям: теплогазоснабжение и вентиляция',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: инженерлік желілер мен құрылыстар бойынша: сумен жабдықтау және канализация/сумен жабдықтау және су шығару',
            'name_ru' => 'Производитель работ: по инженерным сетям и сооружениям: водоснабжение и канализация/водоснабжение и водоотведение',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: инженерлік желілер мен құрылыстар бойынша: байланыс инженері',
            'name_ru' => 'Производитель работ: по инженерным сетям и сооружениям: инженер связи',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: инженерлік желілер мен құрылыстар бойынша: электр инженері',
            'name_ru' => 'Производитель работ: по инженерным сетям и сооружениям: инженер-электрик',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: инженерлік желілер мен құрылыстар бойынша: мұнай және газ инженері',
            'name_ru' => 'Производитель работ: по инженерным сетям и сооружениям: инженер нефти и газа',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: көлік құрылысы бойынша: автомобиль жолдары мен аэродромдар инженері',
            'name_ru' => 'Производитель работ: по транспортному строительству: инженер автомобильных дорог и аэродромов',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: көлік құрылысы бойынша: көпірлер мен тоннельдер инженері',
            'name_ru' => 'Производитель работ: по транспортному строительству: инженер мостов и тоннелей',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: көлік құрылысы бойынша: теміржол жолдары инженері',
            'name_ru' => 'Производитель работ: по транспортному строительству: инженер железнодорожных путей',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: технологиялық жабдықтар бойынша',
            'name_ru' => 'Производитель работ: по технологическому оборудованию',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: тірек және қоршау конструкциялары бойынша: гидротехник',
            'name_ru' => 'Мастер: по несущим и ограждающим конструкциям: гидротехник',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: тірек және қоршау конструкциялары бойынша: құрылыс',
            'name_ru' => 'Мастер: по несущим и ограждающим конструкциям: строительство',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: инженерлік желілер мен құрылыстар бойынша: жылугазбен жабдықтау және желдету',
            'name_ru' => 'Мастер: по инженерным сетям и сооружениям: теплогазоснабжение и вентиляция',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: инженерлік желілер мен құрылыстар бойынша: сумен жабдықтау және канализация/сумен жабдықтау және су шығару',
            'name_ru' => 'Мастер: по инженерным сетям и сооружениям: водоснабжение и канализация/водоснабжение и водоотведение',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: инженерлік желілер мен құрылыстар бойынша: байланыс инженері',
            'name_ru' => 'Мастер: по инженерным сетям и сооружениям: инженер связи',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: инженерлік желілер мен құрылыстар бойынша: электр инженері',
            'name_ru' => 'Мастер: по инженерным сетям и сооружениям: инженер-электрик',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: инженерлік желілер мен құрылыстар бойынша: мұнай және газ инженері',
            'name_ru' => 'Мастер: по инженерным сетям и сооружениям: инженер нефти и газа',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: көлік құрылысы бойынша: автомобиль жолдары мен аэродромдар инженері',
            'name_ru' => 'Мастер: по транспортному строительству: инженер автомобильных дорог и аэродромов',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: көлік құрылысы бойынша: көпірлер мен тоннельдер инженері',
            'name_ru' => 'Мастер: по транспортному строительству: инженер мостов и тоннелей',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: көлік құрылысы бойынша: теміржол жолдары инженері',
            'name_ru' => 'Мастер: по транспортному строительству: инженер железнодорожных путей',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: технологиялық жабдықтар бойынша',
            'name_ru' => 'Мастер: по технологическому оборудованию',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Шебер: тірек және қоршау конструкциялары бойынша: құрылыс жобалау',
            'name_ru' => 'Мастер: по несущим и ограждающим конструкциям: строительное проектирование',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Участок бастығы: тірек және қоршау конструкциялары бойынша: құрылыс жобалау',
            'name_ru' => 'Начальник участка: по несущим и ограждающим конструкциям: строительное проектирование',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: инженерлік желілер мен құрылыстар бойынша (байланыс және АСУТП)',
            'name_ru' => 'Производитель работ: по инженерным сетям и сооружениям (связь и АСУТП)',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жұмыс өндіруші: тірек және қоршау конструкциялары бойынша: құрылыс жобалау',
            'name_ru' => 'Производитель работ: по несущим и ограждающим конструкциям: строительное проектирование',
            'type' => 'СМР'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жобаның бас инженері',
            'name_ru' => 'Главный инженер проекта',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жобаның бас сәулетшісі',
            'name_ru' => 'Главный архитектор проекта',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: тірек және қоршау конструкциялары бойынша: гидротехник',
            'name_ru' => 'Главный конструктор: по несущим и ограждающим конструкциям: гидротехник',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: тірек және қоршау конструкциялары бойынша: құрылыс жобалау',
            'name_ru' => 'Главный конструктор: по несущим и ограждающим конструкциям: строительное проектирование',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: инженерлік желілер мен құрылыстар бойынша: жылугазбен жабдықтау және желдету',
            'name_ru' => 'Главный конструктор: по инженерным сетям и сооружениям: теплогазоснабжение и вентиляция',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: инженерлік желілер мен құрылыстар бойынша: сумен жабдықтау және канализация/сумен жабдықтау және су шығару',
            'name_ru' => 'Главный конструктор: по инженерным сетям и сооружениям: водоснабжение и канализация/водоснабжение и водоотведение',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: инженерлік желілер мен құрылыстар бойынша: байланыс инженері',
            'name_ru' => 'Главный конструктор: по инженерным сетям и сооружениям: инженер связи',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: инженерлік желілер мен құрылыстар бойынша: электр инженері',
            'name_ru' => 'Главный конструктор: по инженерным сетям и сооружениям: инженер-электрик',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: инженерлік желілер мен құрылыстар бойынша: мұнай және газ инженері',
            'name_ru' => 'Главный конструктор: по инженерным сетям и сооружениям: инженер нефти и газа',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: көлік құрылысы бойынша: автомобиль жолдары мен аэродромдар инженері',
            'name_ru' => 'Главный конструктор: по транспортному строительству: инженер автомобильных дорог и аэродромов',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: көлік құрылысы бойынша: көпірлер мен тоннельдер инженері',
            'name_ru' => 'Главный конструктор: по транспортному строительству: инженер мостов и тоннелей',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: көлік құрылысы бойынша: теміржол жолдары инженері',
            'name_ru' => 'Главный конструктор: по транспортному строительству: инженер железнодорожных путей',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Бас конструктор: технологиялық жабдықтар бойынша',
            'name_ru' => 'Главный конструктор: по технологическому оборудованию',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші сәулет жобалау инженері: тірек және қоршау конструкциялары бойынша: гидротехник',
            'name_ru' => 'Ведущий инженер проектировщик по архитектуре: по несущим и ограждающим конструкциям: гидротехник',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші сәулет жобалау инженері',
            'name_ru' => 'Ведущий инженер проектировщик по архитектуре',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші сәулет жобалау инженері: тірек және қоршау конструкциялары бойынша: құрылыс жобалау',
            'name_ru' => 'Ведущий инженер проектировщик по архитектуре: по несущим и ограждающим конструкциям: строительное проектирование',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші жобалау инженері: инженерлік желілер мен құрылыстар бойынша: жылугазбен жабдықтау және желдету',
            'name_ru' => 'Ведущий инженер проектировщик: по инженерным сетям и сооружениям: теплогазоснабжение и вентиляция',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші жобалау инженері: инженерлік желілер мен құрылыстар бойынша: сумен жабдықтау және канализация/сумен жабдықтау және су шығару',
            'name_ru' => 'Ведущий инженер проектировщик: по инженерным сетям и сооружениям: водоснабжение и канализация/водоснабжение и водоотведение',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші жобалау инженері: инженерлік желілер мен құрылыстар бойынша: байланыс инженері',
            'name_ru' => 'Ведущий инженер проектировщик: по инженерным сетям и сооружениям: инженер связи',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші жобалау инженері: инженерлік желілер мен құрылыстар бойынша: электр инженері',
            'name_ru' => 'Ведущий инженер проектировщик: по инженерным сетям и сооружениям: инженер-электрик',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші жобалау инженері: инженерлік желілер мен құрылыстар бойынша: мұнай және газ инженері',
            'name_ru' => 'Ведущий инженер проектировщик: по инженерным сетям и сооружениям: инженер нефти и газа',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші жобалау инженері: көлік құрылысы бойынша: автомобиль жолдары мен аэродромдар инженері',
            'name_ru' => 'Ведущий инженер проектировщик: по транспортному строительству: инженер автомобильных дорог и аэродромов',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші жобалау инженері: көлік құрылысы бойынша: көпірлер мен тоннельдер инженері',
            'name_ru' => 'Ведущий инженер проектировщик: по транспортному строительству: инженер мостов и тоннелей',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші жобалау инженері: көлік құрылысы бойынша: теміржол жолдары инженері',
            'name_ru' => 'Ведущий инженер проектировщик: по транспортному строительству: инженер железнодорожных путей',
            'type' => 'ПД'
        ]);

        \App\Models\Position::create([
            'name_kk' => 'Жетекші жобалау инженері: технологиялық жабдықтар бойынша',
            'name_ru' => 'Ведущий инженер проектировщик: по технологическому оборудованию',
            'type' => 'ПД'
        ]);
    }

    /**
     * Reverse the migrations.
     */
    public function down(): void
    {
        Schema::table('positions', function (Blueprint $table) {
            $table->dropColumn('type');
        });
    }
};
